/**
 * @file
 * @brief File.hppÇÃé¿ëïÇãLèqÇ∑ÇÈÅB
 */
#include "File.hpp"

//------------------------------------------------------------
#include "Assert.hpp"

//------------------------------------------------------------
namespace local {
//------------------------------------------------------------
File::File( const char* aFilepath , const char* aOption )
: fp_( 0 )
{
    fp_ = std::fopen( aFilepath , aOption );
}

//------------------------------------------------------------
File::~File()
{
    if ( fp_ != NULL )
    {
        const int result = std::fclose( fp_ );
        (void)result;
        PJ_ASSERT( result == 0 ); 
    }
}

//------------------------------------------------------------
FILE* File::fp()
{
    return fp_;
}

//------------------------------------------------------------
}
//------------------------------------------------------------
// EOF
